gdmatrix-ws/gdmatrix-ws-security-ri/src/main/resources/org/santfeliu/security/provider/psis/XMLTSCreation.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
    <SOAP-ENV:Body>
        <dss:SignRequest RequestID="I9e54e5e59e9724683b2379f846ec0f98"
                         xmlns:dss="urn:oasis:names:tc:dss:1.0:core:schema"
                         Profile="urn:oasis:names:tc:dss:1.0:profiles:timestamping">
            <dss:OptionalInputs>
                <dss:KeySelector>
                    <!--Netfocus TSA certificate-->
                    <ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
                        <ds:X509Data>
                            <ds:X509Certificate>${CERTIFICATE}</ds:X509Certificate>
                        </ds:X509Data>
                    </ds:KeyInfo>
                </dss:KeySelector>
                <dss:SignatureType>oasis:names:tc:dss:1.0:core:schema:XMLTimeStampToken</dss:SignatureType>
            </dss:OptionalInputs>
            <dss:InputDocuments>
                <dss:DocumentHash ID="Doc">
                    <ds:DigestMethod Algorithm="${DIGEST_METHOD}"
                                     xmlns:ds="http://www.w3.org/2000/09/xmldsig#"/>
                    <ds:DigestValue xmlns:ds="http://www.w3.org/2000/09/xmldsig#">${DIGEST_VALUE}</ds:DigestValue>
                </dss:DocumentHash>
            </dss:InputDocuments>
        </dss:SignRequest>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>